Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: Figure 2.10 shows the percentage of mathematics teachers in Norway and the four reference countries who stated that they had undertaken in-service training in mathematics and/or mathematic education.
nb: Figur 2.10 viser prosentandelen av matematikklærerne i Norge og våre fire referanseland som oppgir at de har fordypning i matematikk og/eller matematikkdidaktikk.

source: ‘Even though other children stand around watching, and waiting their turn to draw or play, the child using the equipment says that it feels like he or she is alone’, Jernes points out.
nb: – Selv om andre barn står omkring og ser på, og venter på sin tur til å tegne eller spille, forteller barna at de har en følelse av å være alene, forteller Jernes.

source: They love it!”
nb: De elsker det!

source: At the same time, this is complicated.
nb: Samtidig er det komplekst.

source: use powers and square roots in exploration and problem solving, and
nb: bruke potenser og kvadratrøtter i utforsking og problemløsing og

source: ‘I didn’t know quite what to expect when physics and chemistry are introduced at preschool level, as prescribed by the curriculum in 2011.
nb: – Jeg var ikke sikker på hva som egentlig skjer når man trekker fysikk og kjemi inn i barnehagen, slik man gjorde i læreplanen i 2011.

source: collect and systematise data and present the results with and without digital aids
nb: innhente og systematisere data og presentere resultatene med og uten digitale hjelpemidler

source: read adapted texts fluently and coherently
nb: lese tilpassede tekster med flyt og sammenheng

source: recognise characteristics of the Norwegian language forms Bokmål and Nynorsk
nb: gjenkjenne særtrekk ved de norske målformene bokmål og nynorsk

source: Natural science subject curriculum (NAT1-02)
nb: Læreplan i naturfag (NAT1-02)

source: In their education, the pupils shall develop knowledge on democratic principles and institutions.
nb: I opplæringen skal elevene utvikle kunnskaper om demokratiske prinsipper og institusjoner.

source: It also deals with the evaluation of the solubility of substances in water in everyday life as well as environmental and industrial contexts.
nb: Videre dreier det seg om vurdering av løselighet av stoffer i vann, både i dagliglivet og i miljømessig og industriell sammenheng.

source: Ann Christin Nilsen has studied childhood for many years.
nb: Ann Christin Nilsen har mange år bak seg som forsker på barndom og oppvekst.

source: The programme area for Landscaper and Sports Facilities Operator consists of two programme subjects.
nb: Programområdet for anleggsgartner- og idrettsanleggsfag er strukturert i to programfag.

source: ENGLISH – PROGRAMME SUBJECT IN PROGRAMMES FOR SPECIALIZATION IN GENERAL STUDIES (ENG4-01)
nb: Læreplan i engelsk - programfag i utdanningsprogram for studiespesialisering (ENG4-01)

source: She would like to challenge what she sees as traditional attitudes to gender.
nb: Hun ønsker å utfordre det hun mener er tradisjonell tenkning om kjønn.

source: describe, explain and present structures and developments in
nb: beskrive, forklare og presentere strukturer og utviklinger i geometriske

source: Listening and expressing oneself in Norwegian or in Sign Language are key to developing social and cultural competences.
nb: Begrepet ”lytte” skal i læreplanen forstås som den prosessen der en mottar og konstruerer mening.

source: Boys and girls play together here more often’, affirms Rossholt.
nb: Og her finner gutter og jenter oftere sammen i lek, fastslår Rossholt.

source: in one’s mother tongue involves expanding the learning arena by searching for and making use of complex, authentic texts from different genres.
nb: i morsmål innebærer å utvide læringsarenaen gjennom å finne fram til og bruke sammensatte, autentiske tekster i ulike sjangere.

source: It covers important topics connected to various aspects of the target-language country's societal life and culture.
nb: Hovedområdet dreier seg også om utvikling av kunnskap om engelsk som et verdensspråk med mange bruksområder.

source: for different types of communication and experiences in creative processes and products
nb: kommunikasjonsformer og opplevelser i skapende prosesser og produkter

source: explain the structure of simple electrical and electronic systems and how they work
nb: forklare oppbygning av og virkemåte til enkle elektriske og elektroniske systemer

source: It also means finding, analysing, processing and presenting information using digital tools.
nb: Videre innebærer det å finne, analysere, behandle og presentere informasjon ved hjelp av digitale verktøy.

source: Writing is a means of developing and structuring one’s thoughts and ideas.
nb: Skriving er en måte å utvikle og strukturere ideer og tanker på.

source: give an account of some characteristics of common vernaculars in Norway and discuss attitudes towards different vernaculars and towards the written language forms Nynorsk and Bokmål
nb: vurdere estetiske virkemidler i sammensatte tekster hentet fra informasjons- og underholdningsmedier, reklame og kunst og reflektere over hvordan vi påvirkes av språk, lyd og bilder

source: ‘One need not be an expert on theatre to put on plays’, concludes Sørensen.
nb: Du behøver ikke være ekspert på teater for å lage drama, konkluderer Sørensen.

source: discuss and elaborate on selected texts from Buddhist written traditions
nb: drøfte utvalgte tekster fra buddhistisk tradisjon

source: Tools for mapping children can be a good support when decisions are to be taken, Nilsen claims.
nb: Verktøy for å kartlegge barn kan være en hjelp når man skal ta beslutninger, mener Nilsen.

source: assess the quality of presentations of own and others observation data and interpretations
nb: vurdere og argumentere for gyldighet og kvalitet av egne og andres observasjonsdata

source: In cases where there were worries about children from socioeconomically advantaged families, the staff found it difficult to do something.
nb: I de tilfellene der det likevel ­oppsto bekymringer rundt barn fra ressurssterke hjem, opplevde de ansatte at det var vanskelig å gjøre noe.

source: present some significant philosophers and discuss their ideas
nb: presentere noen betydningsfulle filosofer og diskutere deres ideer

source: Adults break their own rules when it suits them.
nb: De voksne bryter sine egne regler når det passer dem.

source: describe the characteristics of a selection of plant, mushroom and animal species and tell others how these are ordered systematically
nb: beskrive kjennetegn til et utvalg av plante-, sopp- og dyrearter og fortelle hvordan disse er ordnet systematisk

source: give an account of global population developments, and explain and discuss population changes
nb: gjøre rede for global befolkningsutvikling og forklare og diskutere befolkningsendringer

source: elaborate on and discuss key features of scientific method in physics
nb: gjøre rede for og drøfte sentrale trekk ved vitenskapelig metode i fysikk

source: Numeracy in social studies also involves undertaking quantitative surveys, using map scales and time calculations.
nb: Regning i samfunnsfag dreier seg også om å gjøre undersøkelser med telling, bruke målestokk på kart og regne med tid.

source: The main subject areas complement each other and must be viewed in relation to one another.
nb: Hovedområdene utfyller hverandre og må ses i sammenheng.

source: analyse and assess various genres in texts taken from TV, films and the internet
nb: beskrive og vurdere hvordan sjangere og språkvarianter i tegnspråk brukes av representanter for ulike grupper og i ulike sosiale sammenhenger

source: They are used to talking.
nb: De har blitt vant til å snakke.

source: They learn about the importance of exclusion and integration’, according to Johansson.
nb: Og de lærer om betydningen av ekskludering og integrering, mener Johansson.

source: The programme subject covers the operation and maintenance of facilities and organization of recreational and leisure areas.
nb: Programfaget omfatter drift og vedlikehold av anlegg og tilrettelegging av rekreasjons- og fritidsarealer.

source: read and analyse texts in Bokmål and Nynorsk in different genres in order to form an opinion on the issues they raise and the values they represent
nb: lese og analysere tekster på bokmål og nynorsk i ulike sjangere for å kunne ta stilling til spørsmål tekstene tar opp, og verdier de representerer

source: The Swedish researcher has studied early childhood educators at 30 different Swedish preschools for children between one and five years of age.
nb: Den svenske forskeren har studert barnehagelærere ved 30 ulike barnehager for barn mellom ett og fem år i Sverige.

source: carry out stropping, hooking, rigging and signalling in accordance with relevant regulations with the use of a quayside crane or boat derrick
nb: utføre stropping, anhuking, rigging og signalføring etter gjeldende forskrifter ved å bruke kran på kai og båt

source: The curriculum for mother tongue teaching for language minorities may be used in primary and lower secondary school and in upper secondary education and training.
nb: Læreplanen i morsmål for språklige minoriteter kan brukes både i grunnskolen og innen videregående opplæring.

source: At mealtimes, the toddlers sat in high-chairs.
nb: Under måltidene satt de små barna på høye barnestoler.

source: The children take part in the everyday work in kindergarten, exactly as they would in a family.
nb: Barna er med i det daglige arbeidet i barnehagen, akkurat som de er i familien.

source: In 2014 he did a month fieldwork in two Norwegian kindergartens.
nb: Våren 2014 gjennomførte han en måneds feltarbeid i to norske barnehager.

source: After all, we’ve tried it many times.’
nb: For det har vi prøvd mange ganger.»

source: It is also concerned with communication between people and with social deviations.
nb: Det handler også om kommunikasjon mellom mennesker og sosiale avvik.

source: The subject shall teach knowledge of Christianity, other world religions and philosophies of life, and ethical and philosophical themes.
nb: Faget skal fremme forståelse av og respekt for kristne og humanistiske verdier og evne til dialog mellom mennesker med ulik oppfatning av tros- og livssynsspørsmål.

source: Democracy and co-citizenship
nb: demokrati og medborgerskap

source: describe and analyse some aesthetic and ritual expressions in the religion
nb: handler om utbredelsen av religioner og livssyn både globalt, nasjonalt og lokalt.

source: ‘In today’s kindergartens, girls and boys have equal opportunities, generally speaking’, according to the researcher.
nb: Jenter og gutter i dagens barnehager har i utgangspunktet like muligheter, mener forskeren.

source: create and assess budgets and accounts by using spreadsheets with
nb: lage og vurdere budsjett og regnskap ved å bruke regneark med

source: ‘The ECEC employees are probably not aware of the extent to which values underlie all that they do’, concludes Puroila.
nb: – De barnehageansatte er neppe klar over i hvor stor grad verdier ligger til grunn for det de gjør, konkluderer Puroila.

source: Clarification of recommendations for employees
nb: Skolens rolle ved utbrudd og smittesporing

source: In this project though, we have really tried to look very closely and focus on what a good kindergarten-life for children might be,” tell Nina Winger and Brit Johanne Eide, two of the researchers in the project.
nb: Men i dette prosjektet har vi virkelig prøvd å skjerpe blikket vårt og hatt fokus på hva som kan være et godt barnehageliv for barn, forteller Nina Winger og Brit Johanne Eide, to av forskerne i prosjektet.

source: Documentation and quality 140 teaching hours per year Basic skills
nb: Dokumentasjon og kvalitet 140 årstimer Grunnleggende ferdigheter

source: Competence aims after Vg1 – programmes for general studies and after Vg2 – vocational education programmes
nb: Etter Vg1 studieforberedende og Vg2 yrkesfaglige utdanningsprogram

source: give an account of central stories from the Old Testament from the history of the patriarchs to the prophets
nb: gjøre rede for sentrale fortellinger fra Det gamle testamente fra fedrehistorien til profetene

source: The pupils demonstrate and develop competence in the subject in year 8 when they explore and generalise about mathematical relationships algebraically.
nb: Elevene viser og utvikler kompetanse i faget på 8. trinn når de utforsker og generaliserer matematiske sammenhenger algebraisk.

source: “Conflicts between children always represent a dilemma to the staff.
nb: – Konflikter mellom barna er ­alltid et dilemma for barnehage­ansatte.

source: It is difficult to document’
nb: Det er vanskelig å dokumentere»

source: explain relations between natural resources, industry, settlements and living conditions
nb: forklare sammenhenger mellom naturressurser, næringer, bosetning og levevis

source: Ingunn Størksen is afraid this anxiety can make a bad situation even worse for a child.
nb: Ingunn Størksen er redd denne engstelsen kan gjøre en vond situasjon verre for ungene.

source: give an account of modes of thought in sociology and social anthropology, and use them to explain social contexts
nb: gjøre rede for tenkemåter i sosiologi og sosialantropologi og bruke dem til å forklare sosiale sammenhenger

source: Basic skills are integrated in the competence aims where they contribute to development of the competence in the subject, while also being part of this competence.
nb: Grunnleggende ferdigheter er integrert i kompetansemålene der hvor de bidrar til utvikling av og er en del av fagkompetansen.

source: It also includes three-dimensional vectors, scalar and vector products and parameter presentation.
nb: I tillegg inngår tredimensjonale vektorer, skalar- og vektorprodukt og parameterframstilling.

source: But they were active and joined in the game.
nb: Men de ble aktive og med i leken.

source: Indoor sandboxes are very popular.
nb: Sandkassene inne i barnehagen er veldig populære.

source: This main subject area focuses on examining and discussing how man and society have changed over the centuries.
nb: Historie dreier seg om undersøkelse og drøfting av hvordan mennesker og samfunn har forandret seg gjennom tidene.

source: elaborate on the development of trade, commerce and industry in Norway from around 1500 to around 1800 and analyse the impact on social conditions during this period
nb: gjøre rede for næringsutvikling i Norge fra ca 1500 til ca 1800 og analysere virkningene for sosiale forhold i denne perioden

source: Knowledge of and experience with art and craft traditions and intellectual culture lay the foundation for managing and further developing cultural heritage and preserving one's environment.
nb: Kunnskap om og erfaring med kunst- og håndverkstradisjoner og immateriell kultur gir grunnlag for å forvalte og videreutvikle kulturarv og ta vare på sine omgivelser.

source: use dictionaries and other aids in his or her own language learning
nb: bruke digitale ressurser og andre hjelpemidler i utforsking av språket

source: Furthermore, the subject shall help the pupil learn to talk with other people that have different views of the world where questions of faith and philosophies of life are concerned.
nb: Kunnskaper om religioner og livssyn, og om den funksjon disse har både som tradisjon og som levende kilde til tro, moral og livstolkning, står sentralt i faget.

source: This main subject area covers the political system on all levels and the welfare state.
nb: Hovedområdet omfatter det politiske systemet i Sápmi/Sábme/Saepmie og på alle nivå Norge.

source: The main subject area deals with key issues related to culture and society in the English-speaking world, and covers factual prose, literature and other cultural expressions.
nb: Hovedområdet dreier seg om sentrale emner knyttet til kultur og samfunn i den engelskspråklige verden, og omfatter sakprosa, litteratur og andre kulturytringer.

source: elaborate on and discuss the relationship between text and reality in fictional texts and factual prose texts
nb: drøfte forholdet mellom tekst og virkelighet i fiksjonstekster og sakprosatekster

source: express himself/herself in writing and orally to obtain help in understanding and being understood
nb: uttrykke seg muntlig og skriftlig for å få hjelp til å forstå og bli forstått

source: There are always children who need help to express what they mean, even with friends.
nb: Det kan også gjøres fysisk ved å forstørre et fotografi og dele det i biter slik at dekonstruksjonen blir konkret.

source: assess the use and misuse of resources, consequences this might have for the environment and society, and conflicts this can create locally and globally
nb: vurdere bruk og misbruk av ressurser, konsekvenser det kan få for miljø og samfunn og konflikter dette kan skape lokalt og globalt

source: It’s not the same as being bad,” she says.
nb: Det er ikke det samme som å være slem, sier ­forskeren.

source: in RLE involves being able to apply different ways of viewing historic time and ways of presenting yearly cycles, finding one's way through religious texts, encountering mathematical expressions and numerical symbolism, and interpreting and using statistics.
nb: i KRL innebærer å kunne anvende ulike tidsregninger og måter å framstille årsrytmen på, finne fram i religiøse skrifter, møte matematiske uttrykk og tallsymbolikk og tolke og bruke statistikk.

source: This attitude has been ingrained.
nb: Dette har vært gjennomgangstonen.

source: These skills are important tools in the work to understand and use the new language in increasingly varied and more demanding contexts across cultures and subject areas.
nb: i engelsk for døve og sterkt tunghørte innebærer å uttrykke seg gjennom det engelske skriftspråket i stadig mer varierte og krevende sammenhenger på tvers av kulturer og fagfelt.

source: Many reacted to that’, Puroila explains.
nb: Dette var det mange som reagerte på, forteller Puroila.

source: The structure and guidance for the teaching content are also clearer.
nb: Strukturen og føringene for innholdet i undervisningen er også tydeligere.

source: find examples of events that have helped shape modern Norway, and reflect on how society might have been different if these events had developed differently
nb: finne eksempler på hendelser som har bidratt til å forme dagens Sápmi/Sábme/Saepmie og Norge, og diskutere hvordan samfunnet kunne ha blitt dersom disse hendelsene hadde forløpt annerledes

source: It means applying and interpreting formulas and models of reality, and processing and interpreting various types of data.
nb: Det betyr å bruke og tolke formler og modeller av virkeligheten, og bearbeide og tolke ulike typer data.

source: To describe means to portray or recount an experience, situation, work process or a topic.
nb: Å utforske handler om å oppleve og eksperimentere og kan ivareta nysgjerrighet og undring.

source: give an account of the concepts of attitude, prejudice and racism and evaluate how attitudes can be influenced and how the individual and society can counteract prejudice and racism
nb: gjøre rede for begrepene holdninger, fordommer og rasisme, og vurdere hvordan holdninger kan bli påvirket og hvordan den enkelte og samfunnet kan motarbeide fordommer og rasisme

source: Digital skills also involve being able to communicate and cooperate through digital channels about social science themes and comply with the rules and norms for web-based communication, including personal data protection and copyright law.
nb: Digitale ferdigheter innebærer også å kunne kommunisere og samarbeide digitalt om samfunnsfaglige tema, og å følge regler og normer for nettbasert kommunikasjon, herunder personvern og opphavsrett.

source: This also involves being able to write texts to tangibly express ideas, choices and opinions during practical work.
nb: Det innebærer også å kunne skrive tekster for å synliggjøre ideer, valg og meninger under det praktiske arbeidet.

source: They also demonstrate and develop their competence in mathematics when they have a sense of wonder, ask mathematical questions, test and use mathematical concepts and explain and argue for their own solutions.
nb: Videre viser og utvikler de kompetanse i matematikk når de undrer seg, stiller matematiske spørsmål, tester og bruker matematiske begreper og forklarer og argumenterer for egne løsninger.

source: talk about persons and actions in texts about everyday life, stories or other relevant literature
nb: samtale om personer og handlinger i tekster fra dagliglivet, fortellinger eller annen aktuell litteratur

source: services and children's wellbeing in kindergarten.
nb: og barnas trivsel i barnehagen.

source: The informants agreed that there has to be at least a semblance of order in a situation like the one described, but they did not agree on how to achieve it.
nb: – Deltakerne i panelene våre var enige om at det må være en slags orden i en situasjon som den som ble beskrevet, men de var uenige i måten det foregikk på.

source: write short texts that express opinions and interests, and that describe, narrate and enquire
nb: strukturere tekst etter tidsrekkefølge og tema og skape sammenheng mellom setninger og avsnitt

source: They fed the frog and cared for it, all the while examining it closely.
nb: De har gitt den mat og tatt seg av den samtidig som de har undersøkt den nøye.

source: The teacher provides guidance on further learning and adapts the education to enable the pupils to use the guidance to develop competence in creative processes, environmentally friendly consumption, crafts, visual communication and assessment.
nb: Læreren skal gi veiledning om videre læring og tilpasse opplæringen slik at elevene kan bruke veiledningen for å utvikle kompetansen sin i kreative prosesser, miljøbevisst forbruk, håndverk, visuell kommunikasjon og vurdering.

source: Landscaper and sports facilities operator - curriculum for common programme subjects in VG2 (ADI2-02)
nb: Programområde for anleggsgartner- og idrettsanleggsfag - Læreplan i felles programfag Vg2 (ADI2-02)

source: compare production in different cultures and time periods
nb: sammenlikne produksjon i ulike kulturer og tidsepoker

source: The subject area also covers experiments and calculations linked to everyday life, healthcare, industrial processes and research.
nb: I tillegg omfatter hovedområdet forsøk og beregninger, og disse knyttes til dagligliv og helse og til industrielle prosesser og forskning.

source: elaborate on how social conditions, values and ways of thinking are presented in texts translated from Sami and other languages
nb: gjøre rede for og sammenligne tegnspråkliges og samiske/minoritetsspråkliges rettigheter i Norden og i andre deler av verden

source: It appears as though Norwegian mathematics teachers participate in relevant professional in-service courses to a lesser degree than mathematics teachers in other countries; this applies to all school levels.
nb: Det synes som om norske matematikklærere i mindre grad deltar i faglig relevant etter- og videreutdanning enn matematikklærere i andre land, og at dette gjelder for alle nivåer i skolen.

source: Agreement between educators and the parents of young children may be a crucial element for cooperation with the parents, parental satisfaction and the educators’ jobs.
nb: Uenighet mellom pedagoger og småbarnsforeldre i barnehagen kan være avgjørende for foreldresamarbeidet, foreldres tilfredshet og pedagogenes arbeidsliv.

source: Research, technology, and society
nb: Forskning, teknologi og samfunn

source: Boys are defined by the adults as being more physical active and more restless.
nb: Gutter blir av de voksne definert som mer fysisk aktive og mer urolige.
